---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.IsDone
source: html/fa1240d3-e49d-ec9a-3a6a-10a8b3b6d6e0.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.